---
kind: other
id: Methods.T:Autodesk.Revit.DB.FailureMessageKey
source: html/21e3493d-7985-dd49-0031-cedd7a86fb11.htm
---
# FailureMessageKey Methods

Determines whether the specified Object is equal to the current Object .